Basic Merge Using a Dataframe

In [2]:
import pandas as pd
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [3]:
df2 = pd.DataFrame({
    "city": ["new york", "chicago", "orlando"],
    "humidity": [ 65,68,75]
})
df2

       city  humidity
0  new york        65
1   chicago        68
2   orlando        75

In [5]:
df3 = pd.merge(df1, df2, on="city")
df3

       city  temperature  humidity
0  new york           21        65
1   chicago           14        68
2   orlando           35        75


Type Of DataBase Joins

In [6]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [9]:
df2 = pd.DataFrame({
    "city": ["chicago", "new york", "san diego"],
    "humidity": [65, 68, 71]
})
df2

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

In [11]:
df3 = pd.merge(df1,df2,on="city",how="inner")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [12]:
df3 = pd.merge(df1,df2,on="city",how="outer")
df3

        city  temperature  humidity
0  baltimore         38.0       NaN
1    chicago         14.0      65.0
2   new york         21.0      68.0
3    orlando         35.0       NaN
4  san diego          NaN      71.0

In [13]:
df3 = pd.merge(df1,df2,on="city",how="left")
df3

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           38       NaN

In [14]:
df3 = pd.merge(df1,df2,on="city",how="right")
df3

        city  temperature  humidity
0    chicago         14.0        65
1   new york         21.0        68
2  san diego          NaN        71

Indicator Flag

In [15]:
df3 = pd.merge(df1,df2,on="city",how="left",indicator=True)
df3

        city  temperature  humidity     _merge
0   new york           21      68.0       both
1    chicago           14      65.0       both
2    orlando           35       NaN  left_only
3  baltimore           38       NaN  left_only

Suffixes

In [16]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [17]:

df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df2

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [18]:
df3 = pd.merge(df1,df2,on="city", how="outer", suffixes=("_first", "_second"))
df3

,city,temperature_first,humidity_first,temperature_second,humidity_second
0,baltimore,38.0,75.0,NaN,NaN
1,chicago,14.0,68.0,21.0,65.0
2,new york,21.0,65.0,14.0,68.0
3,orlando,35.0,71.0,NaN,NaN
4,san diego,NaN,NaN,35.0,71.0

Join

In [19]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1.set_index('city', inplace=True)
df1

          temperature
city
new york           21
chicago            14
orlando            35

In [20]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2.set_index('city',inplace=True)
df2

          humidity
city
chicago         65
new york        68
orlando         75

In [21]:
df1.join(df2, lsuffix='_1', rsuffix='_r')

          temperature  humidity
city
new york           21        68
chicago            14        65
orlando            35        75